app/controllers/photo_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", 1]]
SELECT "comments".* FROM "comments" WHERE (1) AND (photo_id=1)
---
def index

  @user = User.find(params[:id])
  @photo = Photo.where(user_id: params[:id])
  # x = Photo.where(user_id: params[:id]).id
  @comment = Comment.where( params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def commented_by(user_id)
  @user = User.find(user_id)